# PANDAS ADVANCE 1 ASSIGNMRENT

### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [2]:
data = {'a':[1,2,3,4],
        'b':[4,5,6,7],
        'c':['sudh','krish','hitesh','naveen']
        

}

In [3]:
df = pd.DataFrame(data)

In [4]:
print(df.columns)

Index(['a', 'b', 'c'], dtype='object')

In [5]:
print(df.describe())

              a         b
count  4.000000  4.000000
mean   2.500000  5.500000
std    1.290994  1.290994
min    1.000000  4.000000
25%    1.750000  4.750000
50%    2.500000  5.500000
75%    3.250000  6.250000
max    4.000000  7.000000

In [6]:
df.isna()

       a      b      c
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [7]:
df.shape

(4, 3)

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
df1 = df

In [9]:
df1

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7  naveen

In [10]:
df1.reindex([1,2,3,4])

     a    b       c
1  2.0  5.0   krish
2  3.0  6.0  hitesh
3  4.0  7.0  naveen
4  NaN  NaN     NaN

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

#### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should 4calculate and print the sum of the first three values, which is 60.

In [11]:
df5 = pd.DataFrame({'Values':[10,20,30,40,50]})

In [12]:
df5.loc[0:2,'Values'].sum()

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [13]:
l = ["Braund Mr Owen Harris",
"Cumings Mr John Bradley",
"Heikkinen Miss Laina",
"Futrelle Mrs Jacques Heath Lily May Peel"]

In [14]:
df6 = pd.DataFrame({'Text':l})

In [15]:
df6

                                       Text
0                     Braund Mr Owen Harris
1                   Cumings Mr John Bradley
2                      Heikkinen Miss Laina
3  Futrelle Mrs Jacques Heath Lily May Peel

In [16]:
df6['Word_count'] = df6['Text'].apply(lambda x : len(x.split()))

In [17]:
df6

                                       Text  Word_count
0                     Braund Mr Owen Harris           4
1                   Cumings Mr John Bradley           4
2                      Heikkinen Miss Laina           3
3  Futrelle Mrs Jacques Heath Lily May Peel           7

### Q5. How are DataFrame.size() and DataFrame.shape() different?

In [18]:
df

   a  b       c
0  1  4    sudh
1  2  5   krish
2  3  6  hitesh
3  4  7  naveen

In [19]:
# it return no of rows and columns available in data
df.shape

(4, 3)

In [20]:
# it returns number of records or entiry in the data
df.size

12

### Q6. Which function of pandas do we use to read an excel file?

In [21]:
# pd.read_excel(url or file name)

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

#### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [22]:
df7 = pd.DataFrame({'Email':['afraz@gmail.com','jay@gmail.com','pandey@gmail.com']})

In [23]:
df7

              Email
0   afraz@gmail.com
1     jay@gmail.com
2  pandey@gmail.com

In [24]:
df7['Usename'] = df7['Email'].apply(lambda x : x.split('@')[0])

In [25]:
df7

              Email Usename
0   afraz@gmail.com   afraz
1     jay@gmail.com     jay
2  pandey@gmail.com  pandey

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

#### For example, if df contains the following values:

 A   B   C

3   5   1


8   2   7

6   9   4

2   3   5

9   1   2

In [26]:
df8 = pd.DataFrame({'A':[3,8,6,2,9],
 'B':[5,2,9,3,1],
 'C':[1,7,4,5,2]})

In [27]:
df8

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [28]:
df9 = df8[(df8['A']>5) & (df8['B']<10)]

In [29]:
df9

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [30]:
df10 = pd.DataFrame({'Values':[10,20,30,40,50]})

In [31]:
df10

   Values
0      10
1      20
2      30
3      40
4      50

In [32]:
print(df10['Values'].mean())
print(df10['Values'].median())
print(df10['Values'].std())

30.0
30.0
15.811388300841896

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [33]:
date_range = pd.date_range(start = '2024-01-01', end = '2024-01-07')

In [34]:
sales = list(range(100,170,10))

In [35]:
df11 = pd.DataFrame({'Date':date_range,
             'Sales':sales})

In [36]:
df11

        Date  Sales
0 2024-01-01    100
1 2024-01-02    110
2 2024-01-03    120
3 2024-01-04    130
4 2024-01-05    140
5 2024-01-06    150
6 2024-01-07    160

In [37]:
df11['Moving Average'] = df11['Sales'].rolling(window = 7).mean()

In [38]:
df11

        Date  Sales  Moving Average
0 2024-01-01    100             NaN
1 2024-01-02    110             NaN
2 2024-01-03    120             NaN
3 2024-01-04    130             NaN
4 2024-01-05    140             NaN
5 2024-01-06    150             NaN
6 2024-01-07    160           130.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [39]:
lst = [
'2023-01-01',
'2023-01-02',
'2023-01-03',
'2023-01-04',
'2023-01-05']

In [40]:
df12 = pd.DataFrame({'Date':lst})

In [41]:
df12.dtypes

Date    object
dtype: object

In [42]:
df12['Date'] = pd.to_datetime(df12['Date'])

In [43]:
df12

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [44]:
df12.dtypes

Date    datetime64[ns]
dtype: object

In [45]:
df12['WeekDay'] = df12['Date'].dt.day_name()

In [46]:
df12

        Date    WeekDay
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [49]:
dt_range = pd.date_range(start='2023-01-01', end = '2023-02-25')

In [54]:
dt2 = pd.DataFrame({"Date1":dt_range})

In [57]:
dt2[(dt2['Date1'] >= '2023-01-01') & (dt2['Date1'] <= '2023-01-31')]

        Date1
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

In [103]:
import pandas as pd

##### this is the most important library to use the basic functions of pandas